---
kind: other
id: Properties.T:Autodesk.Revit.DB.RoutingCriterionBase
source: html/ce95bf86-f006-715e-b5f5-5d2625cb755f.htm
---
# RoutingCriterionBase Properties

Specifies whether the .NET object represents a valid Revit entity.